# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce_schema.png](./e_commerce_schema.png)

### Load Required Libraries

In [26]:
import mysql.connector
import pandas as pd

In [42]:
pd.set_option('display.max_colwidth', None)

### Connect to DB using Mysql-connector-python package

In [27]:
import mysql.connector
  
connection = mysql.connector.connect(host ="localhost",
                                    user ="root",
                                    passwd ="1504mysqlrp7@#")
 
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F3BC2D6550>

### You are required to create a database named 'e_commerce'

In [3]:
## Lets make a connection to Mysql server and perform some operations
import pandas as pd
import mysql.connector

try:
    connection = mysql.connector.connect(host ="localhost",
                                         user ="root",
                                         passwd ="1504mysqlrp7@#")
    cursorObject = connection.cursor()
    cursorObject.execute("SHOW DATABASES")
    databases = cursorObject.fetchall()
    if ('e_comm',) in databases:
        print("Database 'e_comm' already exists.")
    else:
        cursorObject.execute("CREATE DATABASE e_comm")
        print("Database 'e_comm' created successfully.")
except mysql.connector.Error as err:
    print("Failed creating database: {}".format(err))
finally:
    if connection:
        cursorObject.close()
        connection.close()

Database 'e_comm' already exists.

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [4]:
## Connect to Mysql server and choose the database('e_comm') while connecting to the server
import mysql.connector

try:
    connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="1504mysqlrp7@#",
                                     database = "e_comm")

    # creating a cursor object
    cursorObject = connection.cursor()

    table_creation_query = """CREATE TABLE supplier (`SUPP_ID` INT PRIMARY KEY,`SUPP_NAME` varchar(50) ,
                    `SUPP_CITY` varchar(50),`SUPP_PHONE` varchar(10));
                    
                    CREATE TABLE customer (`CUS_ID` INT NOT NULL,`CUS_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    `CUS_PHONE` VARCHAR(10),`CUS_CITY` varchar(30) ,`CUS_GENDER` CHAR,PRIMARY KEY (`CUS_ID`));
                    
                    CREATE TABLE category (`CAT_ID` INT NOT NULL,`CAT_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    PRIMARY KEY (`CAT_ID`));

                    CREATE TABLE product (`PRO_ID` INT NOT NULL,`PRO_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    `PRO_DESC` VARCHAR(60) NULL DEFAULT NULL,`CAT_ID` INT NOT NULL,PRIMARY KEY (`PRO_ID`),
                    FOREIGN KEY (`CAT_ID`) REFERENCES CATEGORY (`CAT_ID`));
                    
                    CREATE TABLE product_details (`PROD_ID` INT NOT NULL,`PRO_ID` INT NOT NULL,`SUPP_ID` INT NOT NULL,
                    `PROD_PRICE` INT NOT NULL, PRIMARY KEY (`PROD_ID`),FOREIGN KEY (`PRO_ID`) REFERENCES PRODUCT (`PRO_ID`),
                    FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER(`SUPP_ID`));
                      
                    CREATE TABLE orders (`ORD_ID` INT NOT NULL,`ORD_AMOUNT` INT NOT NULL,`ORD_DATE` DATE,
                    `CUS_ID` INT NOT NULL,`PROD_ID` INT NOT NULL, PRIMARY KEY (`ORD_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`),
                    FOREIGN KEY (`PROD_ID`) REFERENCES PRODUCT_DETAILS(`PROD_ID`));
                    
                    CREATE TABLE rating (`RAT_ID` INT NOT NULL,`CUS_ID` INT NOT NULL,
                    `SUPP_ID` INT NOT NULL,`RAT_RATSTARS` INT NOT NULL,PRIMARY KEY (`RAT_ID`),
                    FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER (`SUPP_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`));"""
                    
                    
    # Executing the query
    cursorObject.execute(table_creation_query)

except mysql.connector.Error as err:
    print("An error occurred: {}".format(err))

finally:
    if connection:
        cursorObject.close()
        connection.close()

In [12]:
connection.close()

In [14]:
## Connect to Mysql server and choose the database('Orders') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="1504mysqlrp7@#",
                                     database = "e_comm")

# creating a cursor object
cursorObject = connection.cursor()
cursorObject

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [7]:
# insert into "supplier" table
insert_query = "INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
val = [(1,"Rajesh Retails","Delhi",'1234567890'),
          (2,"Appario Ltd.","Mumbai",'2589631470'),
          (3,"Knome products","Banglore",'9785462315'),
          (4,"Bansal Retails","Kochi",'8975463285'),
          (5,"Mittal Ltd.","Lucknow",'7898456532')]

try:
       cursorObject.executemany(insert_query, val)
       connection.commit()
       print("Records inserted successfully.")
except mysql.connector.Error as error:
       print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [8]:
# insert into "customer" table
insert_query = "INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1,"AAKASH",'9999999999',"DELHI",'M'),
       (2,"AMAN",'9785463215',"NOIDA",'M'),
       (3,"NEHA",'9999999999',"MUMBAI",'F'),
       (4,"MEGHA",'9994562399',"KOLKATA",'F'),
       (5,"PULKIT",'7895999999',"LUCKNOW",'M')]


try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [9]:
# insert into "categoty" table
insert_query = "INSERT INTO category (CAT_ID, CAT_NAME) VALUES (%s, %s)"
val = [(1,"BOOKS"),
       (2,"GAMES"),
       (3,"GROCERIES"),
       (4,"ELECTRONICS"),
       (5,"CLOTHES")]


try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [15]:
# insert into "product" table
insert_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]

try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [16]:
# insert into "product_details" table
insert_query = "INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]


try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [17]:
# insert into "orders" table
insert_query = "INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]


try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [18]:
# insert into "rating" table
insert_query = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]


try:
    cursorObject.executemany(insert_query, val)
    connection.commit()
    print("Records inserted successfully.")
except mysql.connector.Error as error:
    print("Failed to insert into MySQL table {}".format(error))

Records inserted successfully.

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [21]:
Query3=     """select customer.cus_gender,count(customer.cus_gender) as count 
            from customer inner join `orders` on customer.cus_id=`orders`.cus_id 
            where `orders`.ord_amount>=3000 group by customer.cus_gender;"""

try:
    cursorObject.execute(Query3)
    output = cursorObject.fetchall()

    ## Lets put the output of this query in pandas DataFrame
    output_df = pd.DataFrame(output, columns=['CUS_GENDER','COUNT'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

  CUS_GENDER  COUNT
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [23]:
Query4 = """SELECT o.*, p.pro_name
FROM `orders` o
JOIN product_details pd ON o.prod_id = pd.prod_id
JOIN product p ON pd.pro_id = p.pro_id
WHERE o.cus_id = 2;
;"""

try:
    cursorObject.execute(Query4)
    output = cursorObject.fetchall()


    output_df = pd.DataFrame(
    output,
    columns=["ORD_ID", "ORD_AMOUNT", "ORD_DATE", "CUS_ID", "PROD_ID", "PRO_NAME"],
)
    output_df = output_df.rename(
    columns={
        "ORD_ID": "Order Id",
        "ORD_AMOUNT": "Order Amount",
        "ORD_DATE": "Order Date",
        "CUS_ID": "Customer Id",
        "PROD_ID": "Product Id",
        "PRO_NAME": "Product Name",
    }
)

    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

   Order Id  Order Amount  Order Date  Customer Id  Product Id Product Name
0        50          2000  2021-10-06            2           1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [24]:
Query5 =     """select s.* 
               from supplier s
               where s.supp_id in 
               (select pd.supp_id from product_details pd
               group by pd.supp_id having count(pd.supp_id)>1) 
               ;"""
try:
    cursorObject.execute(Query5)
    output = cursorObject.fetchall()


    output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [25]:
Q6 = """SELECT CATEGORY.* FROM `ORDERS` 
             INNER JOIN PRODUCT_DETAILS ON `ORDERS`.PROD_ID = PRODUCT_DETAILS.PROD_ID 
             INNER JOIN PRODUCT ON PRODUCT.PRO_ID = PRODUCT_DETAILS.PRO_ID
             INNER JOIN CATEGORY ON CATEGORY.CAT_ID = PRODUCT.CAT_ID 
             WHERE `ORDERS`.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM `ORDERS`);"""

Q6a = """select ct.* from category ct inner join product p on ct.cat_id=p.cat_id 
inner join product_details pd on p.pro_id=pd.pro_id 
inner join orders o on pd.prod_id=o.prod_id order by o.ord_amount asc limit 1; """

try:
    cursorObject.execute(Q6a)
    output = cursorObject.fetchall()

    output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

   CAT_ID   CAT_NAME
0       3  GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [26]:
Q7=     """select product.pro_id,product.pro_name 
               from `orders` inner join product_details on product_details.prod_id=`orders`.prod_id 
               inner join product on product.pro_id=product_details.pro_id where `orders`.ord_date>"2021-10-05";"""

Q7a = """select p.pro_id, p.pro_name from product p
 inner join product_details pd on p.pro_id=pd.pro_id
 inner join orders o on pd.prod_id=o.prod_id where o.ord_date > '2021-10-05'; """

try:
    cursorObject.execute(Q7)
    output = cursorObject.fetchall()


    output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [27]:
Query8=     """select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars 
               from rating inner join supplier on rating.supp_id=supplier.supp_id 
               inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""

try:
    cursorObject.execute(Query8)
    output = cursorObject.fetchall()


    output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','CUS_NAME','RAT_RATSTARS'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [28]:
Q9=     """select customer.cus_name ,customer.cus_gender 
               from customer where customer.cus_name like 'A%' or customer.cus_name like '%A';"""

Q9a = """SELECT c.cus_name, c.cus_gender 
FROM customer c 
WHERE c.cus_name LIKE 'a%' OR c.cus_name LIKE '%a';
 """

try:
    cursorObject.execute(Q9)
    output = cursorObject.fetchall()
    
        
    output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [29]:
Query10 = """SELECT SUM(ORD_AMOUNT) AS TOTAL FROM (
        SELECT O.ORD_AMOUNT,O.CUS_ID,C.CUS_GENDER
        FROM orders O
        INNER JOIN customer C
        ON O.CUS_ID = C.CUS_ID
        WHERE C.CUS_GENDER='M') T;"""

try:
        cursorObject.execute(Query10)
        output = cursorObject.fetchall()

        output_df = pd.DataFrame(output)
        print(output_df)
except Exception as e:
        print("An error occurred: ", e)

       0
0  34500

### Q11) Display all the Customers left outer join with  the orders

In [30]:
cursorObject.execute("""SELECT * 
        FROM e_commerce.customer C
        LEFT OUTER JOIN e_commerce.orders O
        ON C.CUS_ID=O.CUS_ID;""")
    
results=cursorObject.fetchall()
for result in results:
    print(result)

Q11 = """select c.*, o.* from customer c left join orders o on c.cus_id=o.cus_id; """

try:
    cursorObject.execute(Q11)
    output = cursorObject.fetchall()

    output_df = pd.DataFrame(output)
    print(output_df)
except Exception as e:
    print("An error occurred: ", e)

(1, 'AAKASH', '9999999999', 'DELHI', 'M', 26, 2000, datetime.date(2021, 10, 5), 1, 1)
(2, 'AMAN', '9785463215', 'NOIDA', 'M', 50, 2000, datetime.date(2021, 10, 6), 2, 1)
(3, 'NEHA', '9999999999', 'MUMBAI', 'F', 20, 1500, datetime.date(2021, 10, 12), 3, 5)
(4, 'MEGHA', '9994562399', 'KOLKATA', 'F', 30, 3500, datetime.date(2021, 8, 16), 4, 3)
(5, 'PULKIT', '7895999999', 'LUCKNOW', 'M', 25, 30500, datetime.date(2021, 9, 16), 5, 2)
   0       1           2        3  4   5      6           7  8  9
0  1  AAKASH  9999999999    DELHI  M  26   2000  2021-10-05  1  1
1  2    AMAN  9785463215    NOIDA  M  50   2000  2021-10-06  2  1
2  3    NEHA  9999999999   MUMBAI  F  20   1500  2021-10-12  3  5
3  4   MEGHA  9994562399  KOLKATA  F  30   3500  2021-08-16  4  3
4  5  PULKIT  7895999999  LUCKNOW  M  25  30500  2021-09-16  5  2

**NOTE:** Always close an open connection once you are done with the database operations

## Truly GreatLearning:)